In [1]:
import pandas as pd 
import numpy as np

In [2]:
from google.colab import files
uploaded = files.upload()

Saving data.csv to data.csv

In [3]:
import io
df = pd.read_csv(io.BytesIO(uploaded['data.csv']))

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
dir(df)

['Age',
 'CholesterolAfter',
 'CholesterolBefore',
 'DOB',
 'Delta',
 'Group',
 'HR',
 'Name',
 'Smoke',
 'Survey',
 'T',
 'TAG',
 'Vocation',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_TO_AXIS_NUMBER',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_summary_and_see_also_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_box_col_values',
 '_builtin_table',
 '_can_fast_transpose',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_combine_frame',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_from_arguments',
 '_construct_result',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_count_level',
 '_cython_table',
 '_data',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_from_arrays',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_column_array',
 '_get_cython_func',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_gotitem',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_iset_item',
 '_iter_column_arrays',
 '_ix',
 '_ixs',
 '_join_compat',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_replace_columnwise',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_series',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'backfill',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sBP',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'where',
 'xs']

In [6]:
df.head(20)

                 Name         DOB  Age  ... CholesterolAfter  Delta    Group
0        Dylan Patton  1981-10-07   43  ...              0.7    0.5   Active
1       Sandra Howard  1993-01-27   53  ...              1.0    0.2   Active
2   Samantha Williams  1973-12-21   33  ...              1.7    0.3   Active
3      Ashley Hensley  1981-12-01   43  ...              2.1    0.0   Active
4       Robert Wilson  1964-06-23   46  ...              2.8    0.0   Active
5         Leslie Diaz  1994-08-25   48  ...              2.6    0.2   Active
6     Frank Zimmerman  1981-03-04   54  ...              2.6    0.3   Active
7        Aaron Harris  1948-01-10   58  ...              2.9    0.2   Active
8       William Smith  1998-11-20   44  ...              2.8    0.3  Control
9     Andrea Fletcher  1955-12-23   31  ...              2.8    0.4   Active
10        James Wells  1998-08-09   45  ...              2.7    0.5   Active
11         Lisa Perez  1983-09-05   35  ...              2.9    0.4   Active
12   Desiree Sandoval  1981-11-08   49  ...              3.1    0.2   Active
13       Karen Knight  1941-06-14   56  ...              3.3    0.1  Control
14       Evan Stewart  1934-12-22   57  ...              3.4    0.1   Active
15       Mark Johnson  1958-11-22   38  ...              2.9    0.6   Active
16         Roger Chen  1985-11-19   35  ...              3.4    0.1  Control
17     Dennis Sanchez  1945-10-25   50  ...              3.5    0.0   Active
18       Eric Hendrix  1969-05-04   45  ...              3.2    0.4  Control
19   Kathleen Burnett  1970-03-23   49  ...              3.7    0.0   Active

[20 rows x 13 columns]

In [7]:
df.shape

(200, 13)

In [8]:
df.columns

Index(['Name', 'DOB', 'Age', 'Vocation', 'Smoke', 'HR', 'sBP',
       'CholesterolBefore', 'TAG', 'Survey', 'CholesterolAfter', 'Delta',
       'Group'],
      dtype='object')

In [9]:
df.ndim

2

In [11]:
df.size

2600

In [12]:
df.dtypes

Name                  object
DOB                   object
Age                    int64
Vocation              object
Smoke                  int64
HR                     int64
sBP                    int64
CholesterolBefore    float64
TAG                  float64
Survey                 int64
CholesterolAfter     float64
Delta                float64
Group                 object
dtype: object

#EXTRACTING ROWS AND COLUMNS

In [13]:
age_column = df['Age']

In [14]:
type(age_column)

pandas.core.series.Series

In [15]:
age_column = df.Age

In [16]:
age_column.head(10)

0    43
1    53
2    33
3    43
4    46
5    48
6    54
7    58
8    44
9    31
Name: Age, dtype: int64

In [17]:
age = df.Age.to_numpy()

In [18]:
type(age)

numpy.ndarray

In [19]:
dir(age)

['T',
 '__abs__',
 '__add__',
 '__and__',
 '__array__',
 '__array_finalize__',
 '__array_function__',
 '__array_interface__',
 '__array_prepare__',
 '__array_priority__',
 '__array_struct__',
 '__array_ufunc__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__complex__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__float__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__ilshift__',
 '__imatmul__',
 '__imod__',
 '__imul__',
 '__index__',
 '__init__',
 '__init_subclass__',
 '__int__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__irshift__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lshift__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rlshift__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__rpow__',
 '__rrshift__',
 '__rshift__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__xor__',
 'all',
 'any',
 'argmax',
 'argmin',
 'argpartition',
 'argsort',
 'astype',
 'base',
 'byteswap',
 'choose',
 'clip',
 'compress',
 'conj',
 'conjugate',
 'copy',
 'ctypes',
 'cumprod',
 'cumsum',
 'data',
 'diagonal',
 'dot',
 'dtype',
 'dump',
 'dumps',
 'fill',
 'flags',
 'flat',
 'flatten',
 'getfield',
 'imag',
 'item',
 'itemset',
 'itemsize',
 'max',
 'mean',
 'min',
 'nbytes',
 'ndim',
 'newbyteorder',
 'nonzero',
 'partition',
 'prod',
 'ptp',
 'put',
 'ravel',
 'real',
 'repeat',
 'reshape',
 'resize',
 'round',
 'searchsorted',
 'setfield',
 'setflags',
 'shape',
 'size',
 'sort',
 'squeeze',
 'std',
 'strides',
 'sum',
 'swapaxes',
 'take',
 'tobytes',
 'tofile',
 'tolist',
 'tostring',
 'trace',
 'transpose',
 'var',
 'view']

In [20]:
age.min()

30

In [21]:
age.max()

75

In [22]:
age.mean()

53.07

In [23]:
df.iloc[0]

Name                   Dylan Patton
DOB                      1981-10-07
Age                              43
Vocation             Energy manager
Smoke                             0
HR                               47
sBP                             145
CholesterolBefore               1.2
TAG                             1.2
Survey                            1
CholesterolAfter                0.7
Delta                           0.5
Group                        Active
Name: 0, dtype: object

In [24]:
df.iloc[[2, 3, 5]]

                Name         DOB  Age  ... CholesterolAfter  Delta   Group
2  Samantha Williams  1973-12-21   33  ...              1.7    0.3  Active
3     Ashley Hensley  1981-12-01   43  ...              2.1    0.0  Active
5        Leslie Diaz  1994-08-25   48  ...              2.6    0.2  Active

[3 rows x 13 columns]

In [25]:
df.iloc[0:2]

            Name         DOB  Age  ... CholesterolAfter  Delta   Group
0   Dylan Patton  1981-10-07   43  ...              0.7    0.5  Active
1  Sandra Howard  1993-01-27   53  ...              1.0    0.2  Active

[2 rows x 13 columns]

In [26]:
df.iloc[0:5,[1, 2]]

          DOB  Age
0  1981-10-07   43
1  1993-01-27   53
2  1973-12-21   33
3  1981-12-01   43
4  1964-06-23   46

In [27]:
df.loc[0:5, ['DOB', 'Age']]

          DOB  Age
0  1981-10-07   43
1  1993-01-27   53
2  1973-12-21   33
3  1981-12-01   43
4  1964-06-23   46
5  1994-08-25   48

In [28]:
df.iat[3, 2]

43

In [29]:
df.Smoke.unique()

array([0, 2, 1])

In [31]:
non_smoker_age = df[df.Smoke == 0]['Age'].to_numpy()
non_smoker_age

array([43, 53, 33, 43, 46, 48, 54, 58, 44, 31, 45, 35, 49, 56, 57, 35, 50,
       49, 63, 45, 51, 40, 47, 41, 47, 38, 54, 30, 46, 64, 40, 45, 65, 55,
       53, 54, 72, 32, 38, 59, 53, 42, 38, 51, 37, 36, 48, 49, 62, 39, 74,
       42, 72, 61, 33, 30, 44, 71, 49, 75, 43, 55, 38, 36, 46, 60, 57, 69,
       56, 66, 60, 42, 32, 31, 56, 35, 63, 54, 68, 72, 40, 54, 62, 74, 62,
       41, 61, 61])

In [32]:
df.loc[df.Smoke == 0, 'Age'].to_numpy()

array([43, 53, 33, 43, 46, 48, 54, 58, 44, 31, 45, 35, 49, 56, 57, 35, 50,
       49, 63, 45, 51, 40, 47, 41, 47, 38, 54, 30, 46, 64, 40, 45, 65, 55,
       53, 54, 72, 32, 38, 59, 53, 42, 38, 51, 37, 36, 48, 49, 62, 39, 74,
       42, 72, 61, 33, 30, 44, 71, 49, 75, 43, 55, 38, 36, 46, 60, 57, 69,
       56, 66, 60, 42, 32, 31, 56, 35, 63, 54, 68, 72, 40, 54, 62, 74, 62,
       41, 61, 61])

In [33]:
non_smoker_age.mean()

50.09090909090909

NON-SMOKER AGES WHERE SURVEY CHOICE IS 3

In [34]:
non_smoker_satisfied_age = df.loc[(df.Smoke == 0) & (df.Survey == 3), 'Age'].to_numpy()

NEVER SMOKED OR SATISFACTION SCORE GREATER THAN 3

In [35]:
crit = (df.Smoke == 0) | (df.Survey > 3)

In [36]:
non_smoker_or_satisifed_age = df.loc[crit, 'Age'].to_numpy()

NON-SMOKERS AND SATISFACTION SCORE OF 3 OR LESS

In [37]:
# Include those who do not smoke and have a score of more than 3
crit = (df.Smoke == 1) & (df.Survey > 3)

not_no_smoker_satisfied_age = df.loc[~crit, 'Age'].to_numpy()
not_no_smoker_satisfied_age

array([43, 53, 33, 43, 46, 48, 54, 58, 44, 31, 45, 35, 49, 56, 57, 38, 35,
       50, 45, 49, 63, 45, 51, 43, 31, 58, 40, 47, 45, 41, 47, 38, 54, 30,
       46, 64, 40, 45, 65, 74, 55, 58, 53, 68, 54, 72, 32, 38, 59, 53, 42,
       67, 38, 51, 37, 36, 34, 31, 48, 49, 62, 39, 74, 42, 60, 67, 42, 52,
       37, 61, 72, 49, 49, 49, 43, 38, 45, 71, 73, 60, 70, 49, 65, 30, 50,
       69, 72, 61, 33, 30, 44, 71, 49, 75, 43, 35, 55, 38, 36, 46, 60, 40,
       57, 69, 56, 66, 60, 42, 49, 68, 32, 31, 56, 35, 63, 54, 68, 72, 40,
       41, 66, 73, 36, 57, 74, 48, 72, 71, 42, 54, 58, 60, 63, 44, 55, 43,
       71, 54, 61, 55, 67, 68, 71, 54, 57, 45, 62, 33, 74, 43, 35, 64, 55,
       74, 50, 40, 62, 63, 68, 41, 72, 61, 70, 61, 65, 66])

##CREATE A NEW DATAFRAME OBJECT THAT ONLY CONTAINS PARTICIPANTS YOUNGER THAN 50

In [38]:
new_df = df[df.Age < 50]
new_df.head(10)

                 Name         DOB  Age  ... CholesterolAfter  Delta    Group
0        Dylan Patton  1981-10-07   43  ...              0.7    0.5   Active
2   Samantha Williams  1973-12-21   33  ...              1.7    0.3   Active
3      Ashley Hensley  1981-12-01   43  ...              2.1    0.0   Active
4       Robert Wilson  1964-06-23   46  ...              2.8    0.0   Active
5         Leslie Diaz  1994-08-25   48  ...              2.6    0.2   Active
8       William Smith  1998-11-20   44  ...              2.8    0.3  Control
9     Andrea Fletcher  1955-12-23   31  ...              2.8    0.4   Active
10        James Wells  1998-08-09   45  ...              2.7    0.5   Active
11         Lisa Perez  1983-09-05   35  ...              2.9    0.4   Active
12   Desiree Sandoval  1981-11-08   49  ...              3.1    0.2   Active

[10 rows x 13 columns]

In [39]:
new_df.Age.max()

49

In [40]:
new_df['Age'].max()

49

In [41]:
new_df.loc[:, 'Age'].max()

49

##CREATE A NEW DATAFRAME FOR PARTICIPANTS WITH A RESTRICTED LIST OF JOB TITLES

In [42]:
# Create a Python list object with all the column names
jobs = ['IT consultant', 'Energy manager', 'Clinical embryologist']

# Build a criterium
crit = df.Vocation.isin(jobs)

# Create the new dataframe object and print the first 5 rows to the screen
jobs_df = df.loc[crit]
jobs_df.head(10)

                  Name         DOB  Age  ... CholesterolAfter  Delta    Group
0         Dylan Patton  1981-10-07   43  ...              0.7    0.5   Active
2    Samantha Williams  1973-12-21   33  ...              1.7    0.3   Active
4        Robert Wilson  1964-06-23   46  ...              2.8    0.0   Active
188        Joan Chavez  1999-10-07   41  ...              8.8    0.3  Control

[4 rows x 13 columns]

##CREATE A NEW DATAFRAME WHERE THE WORD MANAGER APPEARS IN THE VOCATION COLUMN

In [43]:
# Build a criterium with the str.contains method
crit = df.Vocation.str.contains('manager', na=False)

vocation_df = df.loc[crit]
vocation_df.head(10)

                         Name         DOB  ...  Delta    Group
0                Dylan Patton  1981-10-07  ...    0.5   Active
34   Mr. Tyler Strickland DDS  1940-08-27  ...    0.3  Control
54           Stephanie Jacobs  1977-06-18  ...    0.4   Active
55               Juan Johnson  1956-12-09  ...    0.5  Control
71              Tina Martinez  1941-05-31  ...    0.3   Active
107              Kelly Rivera  1939-07-05  ...    0.1   Active
127             Michael Black  1973-03-18  ...    0.2   Active
130          Stephanie Pruitt  1996-01-09  ...    0.3   Active
145             Kevin Shields  1982-04-19  ...    0.4   Active
146            Jennifer Kelly  1970-11-05  ...    0.0  Control

[10 rows x 13 columns]

##UPDATING OR CHANGING THE VALUES IN A DATAFRAME

###RENAMING COLUMNS

In [44]:
df.rename(columns={'Name':'Participant'}, inplace=True)
df.columns

Index(['Participant', 'DOB', 'Age', 'Vocation', 'Smoke', 'HR', 'sBP',
       'CholesterolBefore', 'TAG', 'Survey', 'CholesterolAfter', 'Delta',
       'Group'],
      dtype='object')

In [45]:
df.head()

         Participant         DOB  Age  ... CholesterolAfter  Delta   Group
0       Dylan Patton  1981-10-07   43  ...              0.7    0.5  Active
1      Sandra Howard  1993-01-27   53  ...              1.0    0.2  Active
2  Samantha Williams  1973-12-21   33  ...              1.7    0.3  Active
3     Ashley Hensley  1981-12-01   43  ...              2.1    0.0  Active
4      Robert Wilson  1964-06-23   46  ...              2.8    0.0  Active

[5 rows x 13 columns]

ADD  2  TO EACH AGE VALUE

In [46]:
def add2(x):
  return x + 2

In [47]:
df.Age.head()

0    43
1    53
2    33
3    43
4    46
Name: Age, dtype: int64

In [48]:
df.Age = df.Age.apply(add2)
df.Age.head()

0    45
1    55
2    35
3    45
4    48
Name: Age, dtype: int64

In [49]:
df.Age = df.Age.apply(lambda x: x - 2)
df.Age.head()

0    43
1    53
2    33
3    43
4    46
Name: Age, dtype: int64

In [50]:
df.Age = df.Age + 2

In [51]:
df.Age.head()

0    45
1    55
2    35
3    45
4    48
Name: Age, dtype: int64

CHANGE NOMINAL VARIABLE TO ORDINAL VARIABLE

In [52]:
df.Group = df.Group.map({'Control':0, 'Active':1})
df.Group.head()

0    1
1    1
2    1
3    1
4    1
Name: Group, dtype: int64

In [53]:
df.head()

         Participant         DOB  Age  ... CholesterolAfter  Delta  Group
0       Dylan Patton  1981-10-07   45  ...              0.7    0.5      1
1      Sandra Howard  1993-01-27   55  ...              1.0    0.2      1
2  Samantha Williams  1973-12-21   35  ...              1.7    0.3      1
3     Ashley Hensley  1981-12-01   45  ...              2.1    0.0      1
4      Robert Wilson  1964-06-23   48  ...              2.8    0.0      1

[5 rows x 13 columns]

###CHANGING COLUMNS

SPLITTING THE PATIENT COLUMN INTO A FirstName and LastName COLUMN

In [54]:
new_data = df.Participant.str.split(' ', expand=True)
df['FirstName'] = new_data[0]
df['LastName'] = new_data[1]
df.head()

         Participant         DOB  Age  ... Group  FirstName  LastName
0       Dylan Patton  1981-10-07   45  ...     1      Dylan    Patton
1      Sandra Howard  1993-01-27   55  ...     1     Sandra    Howard
2  Samantha Williams  1973-12-21   35  ...     1   Samantha  Williams
3     Ashley Hensley  1981-12-01   45  ...     1     Ashley   Hensley
4      Robert Wilson  1964-06-23   48  ...     1     Robert    Wilson

[5 rows x 15 columns]

In [55]:
df['Name'] = df.LastName + ', ' + df.FirstName
df.Name.head()

0         Patton, Dylan
1        Howard, Sandra
2    Williams, Samantha
3       Hensley, Ashley
4        Wilson, Robert
Name: Name, dtype: object

CREATE A CATEGORICAL VARIABLE FROM NUMERICAL DATA

In [56]:
df.CholesterolBefore.min()

1.2

In [57]:
df.CholesterolBefore.max()

11.1

In [58]:
# Non-physiological binning of cholesterol values
df['CholesterolBeforeLevel'] = pd.cut(df.CholesterolBefore, bins=3, labels=['low', 'intermediate', 'high'])

In [59]:
df[['CholesterolBefore', 'CholesterolBeforeLevel']].head(10).to_numpy()

array([[1.2, 'low'],
       [1.2, 'low'],
       [2.0, 'low'],
       [2.1, 'low'],
       [2.8, 'low'],
       [2.8, 'low'],
       [2.9, 'low'],
       [3.1, 'low'],
       [3.1, 'low'],
       [3.2, 'low']], dtype=object)

In [60]:
df.CholesterolBeforeLevel = pd.cut(df.CholesterolBefore,
                                   bins=[0,5,10,20],
                                   right=False,
                                   labels=['low', 'normal', 'high'])

DELETE A COLUMN

In [61]:
df.drop(columns=['Name'], inplace=True)

In [62]:
df.columns

Index(['Participant', 'DOB', 'Age', 'Vocation', 'Smoke', 'HR', 'sBP',
       'CholesterolBefore', 'TAG', 'Survey', 'CholesterolAfter', 'Delta',
       'Group', 'FirstName', 'LastName', 'CholesterolBeforeLevel'],
      dtype='object')

###SORTING

In [63]:
df.sort_values(by='LastName')

              Participant         DOB  ...   LastName CholesterolBeforeLevel
53     Christopher Abbott  1963-06-12  ...     Abbott                    low
170          Mary Aguilar  1952-01-09  ...    Aguilar                 normal
22          James Aguilar  2000-11-05  ...    Aguilar                    low
81   Marissa Anderson PhD  1940-05-15  ...   Anderson                 normal
152       Andrea Anderson  1974-04-08  ...   Anderson                 normal
..                    ...         ...  ...        ...                    ...
157             Jodi Wood  1946-11-29  ...       Wood                 normal
185          James Wright  1997-09-20  ...     Wright                 normal
60            Janet Young  1981-03-18  ...      Young                    low
6         Frank Zimmerman  1981-03-04  ...  Zimmerman                    low
100    Kristina Zimmerman  1994-01-01  ...  Zimmerman                 normal

[200 rows x 16 columns]

In [64]:
df.sort_values(by='LastName', ascending=False)

              Participant         DOB  ...   LastName CholesterolBeforeLevel
100    Kristina Zimmerman  1994-01-01  ...  Zimmerman                 normal
6         Frank Zimmerman  1981-03-04  ...  Zimmerman                    low
60            Janet Young  1981-03-18  ...      Young                    low
185          James Wright  1997-09-20  ...     Wright                 normal
157             Jodi Wood  1946-11-29  ...       Wood                 normal
..                    ...         ...  ...        ...                    ...
152       Andrea Anderson  1974-04-08  ...   Anderson                 normal
81   Marissa Anderson PhD  1940-05-15  ...   Anderson                 normal
22          James Aguilar  2000-11-05  ...    Aguilar                    low
170          Mary Aguilar  1952-01-09  ...    Aguilar                 normal
53     Christopher Abbott  1963-06-12  ...     Abbott                    low

[200 rows x 16 columns]

In [65]:
df.sort_values(by=['Age', 'sBP'])

          Participant         DOB  ...   LastName CholesterolBeforeLevel
33          Kyle Boyd  1959-12-30  ...       Boyd                    low
96      Brandi Ibarra  1973-11-01  ...     Ibarra                 normal
103    Mary Rodriguez  2001-07-07  ...  Rodriguez                 normal
9     Andrea Fletcher  1955-12-23  ...   Fletcher                    low
60        Janet Young  1981-03-18  ...      Young                    low
..                ...         ...  ...        ...                    ...
139    Carrie Sanders  1971-03-14  ...    Sanders                 normal
172  Kathleen Goodwin  1938-05-14  ...    Goodwin                 normal
180       Paula White  1979-03-04  ...      White                 normal
173      Debra Hoover  1971-07-16  ...     Hoover                 normal
107      Kelly Rivera  1939-07-05  ...     Rivera                 normal

[200 rows x 16 columns]

In [66]:
df.sort_values(by=['Age', 'sBP'], ascending=[True, False])

           Participant         DOB  ...   LastName CholesterolBeforeLevel
103     Mary Rodriguez  2001-07-07  ...  Rodriguez                 normal
96       Brandi Ibarra  1973-11-01  ...     Ibarra                 normal
33           Kyle Boyd  1959-12-30  ...       Boyd                    low
125    Victoria Gordon  1956-08-05  ...     Gordon                 normal
24   Clifford Williams  1957-05-04  ...   Williams                    low
..                 ...         ...  ...        ...                    ...
139     Carrie Sanders  1971-03-14  ...    Sanders                 normal
65        Joseph Smith  1981-11-17  ...      Smith                    low
71       Tina Martinez  1941-05-31  ...   Martinez                    low
40         Laurie Clay  1981-06-12  ...       Clay                    low
107       Kelly Rivera  1939-07-05  ...     Rivera                 normal

[200 rows x 16 columns]

In [67]:
df.sBP.nlargest(15)

197    212
199    208
143    205
190    203
194    203
191    202
195    201
198    200
174    198
178    198
189    198
166    196
173    195
163    194
179    194
Name: sBP, dtype: int64

In [68]:
df.nlargest(10, 'sBP')

           Participant         DOB  ...  LastName CholesterolBeforeLevel
197      Charles Smith  1959-01-30  ...     Smith                   high
199      Julie Barrett  1972-07-27  ...   Barrett                   high
143      Jeremy Wagner  1938-12-10  ...    Wagner                 normal
190     Rachel Mcguire  1970-12-23  ...   Mcguire                 normal
194      Jeffery Silva  1973-11-25  ...     Silva                 normal
191      Angela Wilson  1983-08-24  ...    Wilson                 normal
195        John Curtis  1936-11-25  ...    Curtis                   high
198       Barry Porter  1979-05-30  ...    Porter                   high
174       Heidi Gaines  1974-06-26  ...    Gaines                 normal
178  Jonathan Bautista  1938-06-28  ...  Bautista                 normal

[10 rows x 16 columns]

###MISSING VALUES

In [69]:
my_list = [1, 2, 3, np.nan]
my_list

[1, 2, 3, nan]

In [70]:
np.sum(my_list)

nan

A DATAFRAME WITH MISSING DATA

In [72]:
from google.colab import files
uploaded = files.upload()

Saving MissingData.csv to MissingData.csv

In [73]:
missing_df = pd.read_csv(io.BytesIO(uploaded['MissingData.csv']))

In [74]:
missing_df.head(20)

     age   salary  previous_company
0   57.0      NaN               1.0
1   56.0  50927.0               NaN
2   46.0  75500.0               3.0
3    NaN  84417.0               NaN
4   60.0  63002.0               1.0
5   54.0  54652.0               NaN
6    NaN  65739.0               1.0
7   64.0  89397.0               3.0
8   60.0  77797.0               4.0
9   61.0      NaN               1.0
10  51.0  92767.0               5.0
11   NaN  59873.0               2.0
12  49.0  91001.0               4.0
13  59.0  54212.0               4.0
14  61.0  84423.0               2.0
15   NaN      NaN               3.0
16  61.0  84930.0               NaN
17  48.0  63824.0               5.0
18  53.0  53143.0               2.0
19  49.0  59842.0               NaN

DELETING MISSING DATA

In [75]:
complete_data_df = missing_df.dropna() # Non permanent removal
complete_data_df

     age   salary  previous_company
2   46.0  75500.0               3.0
4   60.0  63002.0               1.0
7   64.0  89397.0               3.0
8   60.0  77797.0               4.0
10  51.0  92767.0               5.0
12  49.0  91001.0               4.0
13  59.0  54212.0               4.0
14  61.0  84423.0               2.0
17  48.0  63824.0               5.0
18  53.0  53143.0               2.0
20  55.0  79309.0               2.0
22  49.0  52895.0               1.0
23  57.0  54035.0               3.0
24  58.0  64962.0               3.0
26  63.0  63861.0               2.0
27  47.0  55188.0               3.0
28  63.0  61220.0               3.0
30  49.0  63398.0               1.0
31  57.0  94900.0               5.0

In [76]:
missing_df.dropna(subset=['age'])

     age   salary  previous_company
0   57.0      NaN               1.0
1   56.0  50927.0               NaN
2   46.0  75500.0               3.0
4   60.0  63002.0               1.0
5   54.0  54652.0               NaN
7   64.0  89397.0               3.0
8   60.0  77797.0               4.0
9   61.0      NaN               1.0
10  51.0  92767.0               5.0
12  49.0  91001.0               4.0
13  59.0  54212.0               4.0
14  61.0  84423.0               2.0
16  61.0  84930.0               NaN
17  48.0  63824.0               5.0
18  53.0  53143.0               2.0
19  49.0  59842.0               NaN
20  55.0  79309.0               2.0
21  59.0      NaN               4.0
22  49.0  52895.0               1.0
23  57.0  54035.0               3.0
24  58.0  64962.0               3.0
25  61.0      NaN               1.0
26  63.0  63861.0               2.0
27  47.0  55188.0               3.0
28  63.0  61220.0               3.0
29  54.0  98314.0               NaN
30  49.0  63398.0               1.0
31  57.0  94900.0               5.0

In [77]:
missing_df.age.isna()

0     False
1     False
2     False
3      True
4     False
5     False
6      True
7     False
8     False
9     False
10    False
11     True
12    False
13    False
14    False
15     True
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
Name: age, dtype: bool

In [78]:
missing_df.age.isna().sum()

4

REPLACING MISSING VALUES

In [79]:
missing_df.age.fillna(method='ffill')

0     57.0
1     56.0
2     46.0
3     46.0
4     60.0
5     54.0
6     54.0
7     64.0
8     60.0
9     61.0
10    51.0
11    51.0
12    49.0
13    59.0
14    61.0
15    61.0
16    61.0
17    48.0
18    53.0
19    49.0
20    55.0
21    59.0
22    49.0
23    57.0
24    58.0
25    61.0
26    63.0
27    47.0
28    63.0
29    54.0
30    49.0
31    57.0
Name: age, dtype: float64

In [80]:
# The median age (pandas ignores the missing values)
missing_df.age.median()

57.0

In [81]:
missing_df.age.fillna(missing_df.age.median())

0     57.0
1     56.0
2     46.0
3     57.0
4     60.0
5     54.0
6     57.0
7     64.0
8     60.0
9     61.0
10    51.0
11    57.0
12    49.0
13    59.0
14    61.0
15    57.0
16    61.0
17    48.0
18    53.0
19    49.0
20    55.0
21    59.0
22    49.0
23    57.0
24    58.0
25    61.0
26    63.0
27    47.0
28    63.0
29    54.0
30    49.0
31    57.0
Name: age, dtype: float64

DEFAULT MISSING DATA

In [83]:
from google.colab import files
uploaded = files.upload()

Saving DefaultMissingData.csv to DefaultMissingData.csv

In [84]:
default_missing_df = pd.read_csv(io.BytesIO(uploaded['DefaultMissingData.csv']))

In [85]:
default_missing_df

    age salary previous_company
0    57    Nil                1
1    56  50927          Missing
2    46  75500                3
3   999  84417          Missing
4    60  63002                1
5    54  54652          Missing
6   999  65739                1
7    64  89397                3
8    60  77797                4
9    61    Nil                1
10   51  92767                5
11  999  59873                2
12   49  91001                4
13   59  54212                4
14   61  84423                2
15  999    Nil                3
16   61  84930          Missing
17   48  63824                5
18   53  53143                2
19   49  59842          Missing

In [86]:
default_missing_df = pd.read_csv('DefaultMissingData.csv', na_values=[999, 'Nil', 'Missing'])
default_missing_df

     age   salary  previous_company
0   57.0      NaN               1.0
1   56.0  50927.0               NaN
2   46.0  75500.0               3.0
3    NaN  84417.0               NaN
4   60.0  63002.0               1.0
5   54.0  54652.0               NaN
6    NaN  65739.0               1.0
7   64.0  89397.0               3.0
8   60.0  77797.0               4.0
9   61.0      NaN               1.0
10  51.0  92767.0               5.0
11   NaN  59873.0               2.0
12  49.0  91001.0               4.0
13  59.0  54212.0               4.0
14  61.0  84423.0               2.0
15   NaN      NaN               3.0
16  61.0  84930.0               NaN
17  48.0  63824.0               5.0
18  53.0  53143.0               2.0
19  49.0  59842.0               NaN
20  55.0  79309.0               2.0
21  59.0      NaN               4.0
22  49.0  52895.0               1.0
23  57.0  54035.0               3.0
24  58.0  64962.0               3.0
25  61.0      NaN               1.0
26  63.0  63861.0               2.0
27  47.0  55188.0               3.0
28  63.0  61220.0               3.0
29  54.0  98314.0               NaN
30  49.0  63398.0               1.0
31  57.0  94900.0               5.0

WORKING WITH DATES AND TIMES

In [87]:
from google.colab import files
uploaded = files.upload()

Saving DatesTimes.csv to DatesTimes.csv

In [88]:
dt = pd.read_csv(io.BytesIO(uploaded['DatesTimes.csv']))

In [89]:
dt

     ID  Batch SpecimenDate    TestDate TestTime
0   183      3   2025/04/21  2025/04/26    12:23
1   198      2   2025/04/21  2025/04/26    12:26
2   194      1   2025/04/22  2025/04/26    12:11
3   192      2   2025/04/22  2025/04/25    12:05
4   143      2   2025/04/22  2025/04/25    13:45
5   143      2   2025/04/22  2025/04/26    11:59
6   171      2   2025/04/22  2025/04/25    12:34
7   152      1   2025/04/23  2025/04/28    13:59
8   111      1   2025/04/23  2025/04/26    13:54
9   121      3   2025/04/23  2025/04/26    11:34
10  188      2   2025/04/23  2025/04/27    09:34
11  127      3   2025/04/24  2025/04/29    13:33
12  179      2   2025/04/24  2025/04/29    14:45
13  160      1   2025/04/24  2025/04/29    15:01
14  117      2   2025/04/24  2025/04/29    14:35
15  130      2   2025/04/25  2025/04/30    12:12
16  173      3   2025/04/25  2025/04/28    13:12
17  190      1   2025/04/26  2025/04/29    12:32
18  141      2   2025/04/26  2025/04/30    12:17
19  101      1   2025/04/26  2025/04/30    11:56
20  102      3   2025/04/27  2025/04/30    11:58
21  112      2   2025/04/27  2025/05/01    10:56
22  157      1   2025/04/28  2025/05/01    10:33
23  196      1   2025/04/28  2025/05/02    11:01

In [90]:
dt.dtypes

ID               int64
Batch            int64
SpecimenDate    object
TestDate        object
TestTime        object
dtype: object

In [91]:
dt['DateTime'] = dt.TestDate + ' ' + dt.TestTime  # Add a space
dt

     ID  Batch SpecimenDate    TestDate TestTime          DateTime
0   183      3   2025/04/21  2025/04/26    12:23  2025/04/26 12:23
1   198      2   2025/04/21  2025/04/26    12:26  2025/04/26 12:26
2   194      1   2025/04/22  2025/04/26    12:11  2025/04/26 12:11
3   192      2   2025/04/22  2025/04/25    12:05  2025/04/25 12:05
4   143      2   2025/04/22  2025/04/25    13:45  2025/04/25 13:45
5   143      2   2025/04/22  2025/04/26    11:59  2025/04/26 11:59
6   171      2   2025/04/22  2025/04/25    12:34  2025/04/25 12:34
7   152      1   2025/04/23  2025/04/28    13:59  2025/04/28 13:59
8   111      1   2025/04/23  2025/04/26    13:54  2025/04/26 13:54
9   121      3   2025/04/23  2025/04/26    11:34  2025/04/26 11:34
10  188      2   2025/04/23  2025/04/27    09:34  2025/04/27 09:34
11  127      3   2025/04/24  2025/04/29    13:33  2025/04/29 13:33
12  179      2   2025/04/24  2025/04/29    14:45  2025/04/29 14:45
13  160      1   2025/04/24  2025/04/29    15:01  2025/04/29 15:01
14  117      2   2025/04/24  2025/04/29    14:35  2025/04/29 14:35
15  130      2   2025/04/25  2025/04/30    12:12  2025/04/30 12:12
16  173      3   2025/04/25  2025/04/28    13:12  2025/04/28 13:12
17  190      1   2025/04/26  2025/04/29    12:32  2025/04/29 12:32
18  141      2   2025/04/26  2025/04/30    12:17  2025/04/30 12:17
19  101      1   2025/04/26  2025/04/30    11:56  2025/04/30 11:56
20  102      3   2025/04/27  2025/04/30    11:58  2025/04/30 11:58
21  112      2   2025/04/27  2025/05/01    10:56  2025/05/01 10:56
22  157      1   2025/04/28  2025/05/01    10:33  2025/05/01 10:33
23  196      1   2025/04/28  2025/05/02    11:01  2025/05/02 11:01

In [92]:
dt.DateTime.dtype

dtype('O')

In [93]:
dt['datetime'] = pd.to_datetime(dt.DateTime, format='%Y/%m/%d %H:%M')
dt

     ID  Batch SpecimenDate  ... TestTime          DateTime            datetime
0   183      3   2025/04/21  ...    12:23  2025/04/26 12:23 2025-04-26 12:23:00
1   198      2   2025/04/21  ...    12:26  2025/04/26 12:26 2025-04-26 12:26:00
2   194      1   2025/04/22  ...    12:11  2025/04/26 12:11 2025-04-26 12:11:00
3   192      2   2025/04/22  ...    12:05  2025/04/25 12:05 2025-04-25 12:05:00
4   143      2   2025/04/22  ...    13:45  2025/04/25 13:45 2025-04-25 13:45:00
5   143      2   2025/04/22  ...    11:59  2025/04/26 11:59 2025-04-26 11:59:00
6   171      2   2025/04/22  ...    12:34  2025/04/25 12:34 2025-04-25 12:34:00
7   152      1   2025/04/23  ...    13:59  2025/04/28 13:59 2025-04-28 13:59:00
8   111      1   2025/04/23  ...    13:54  2025/04/26 13:54 2025-04-26 13:54:00
9   121      3   2025/04/23  ...    11:34  2025/04/26 11:34 2025-04-26 11:34:00
10  188      2   2025/04/23  ...    09:34  2025/04/27 09:34 2025-04-27 09:34:00
11  127      3   2025/04/24  ...    13:33  2025/04/29 13:33 2025-04-29 13:33:00
12  179      2   2025/04/24  ...    14:45  2025/04/29 14:45 2025-04-29 14:45:00
13  160      1   2025/04/24  ...    15:01  2025/04/29 15:01 2025-04-29 15:01:00
14  117      2   2025/04/24  ...    14:35  2025/04/29 14:35 2025-04-29 14:35:00
15  130      2   2025/04/25  ...    12:12  2025/04/30 12:12 2025-04-30 12:12:00
16  173      3   2025/04/25  ...    13:12  2025/04/28 13:12 2025-04-28 13:12:00
17  190      1   2025/04/26  ...    12:32  2025/04/29 12:32 2025-04-29 12:32:00
18  141      2   2025/04/26  ...    12:17  2025/04/30 12:17 2025-04-30 12:17:00
19  101      1   2025/04/26  ...    11:56  2025/04/30 11:56 2025-04-30 11:56:00
20  102      3   2025/04/27  ...    11:58  2025/04/30 11:58 2025-04-30 11:58:00
21  112      2   2025/04/27  ...    10:56  2025/05/01 10:56 2025-05-01 10:56:00
22  157      1   2025/04/28  ...    10:33  2025/05/01 10:33 2025-05-01 10:33:00
23  196      1   2025/04/28  ...    11:01  2025/05/02 11:01 2025-05-02 11:01:00

[24 rows x 7 columns]

In [94]:
dt.dtypes

ID                       int64
Batch                    int64
SpecimenDate            object
TestDate                object
TestTime                object
DateTime                object
datetime        datetime64[ns]
dtype: object

In [95]:
dt['month'] = dt.datetime.dt.month_name().str.slice(stop=3)
dt

     ID  Batch SpecimenDate  ...          DateTime            datetime month
0   183      3   2025/04/21  ...  2025/04/26 12:23 2025-04-26 12:23:00   Apr
1   198      2   2025/04/21  ...  2025/04/26 12:26 2025-04-26 12:26:00   Apr
2   194      1   2025/04/22  ...  2025/04/26 12:11 2025-04-26 12:11:00   Apr
3   192      2   2025/04/22  ...  2025/04/25 12:05 2025-04-25 12:05:00   Apr
4   143      2   2025/04/22  ...  2025/04/25 13:45 2025-04-25 13:45:00   Apr
5   143      2   2025/04/22  ...  2025/04/26 11:59 2025-04-26 11:59:00   Apr
6   171      2   2025/04/22  ...  2025/04/25 12:34 2025-04-25 12:34:00   Apr
7   152      1   2025/04/23  ...  2025/04/28 13:59 2025-04-28 13:59:00   Apr
8   111      1   2025/04/23  ...  2025/04/26 13:54 2025-04-26 13:54:00   Apr
9   121      3   2025/04/23  ...  2025/04/26 11:34 2025-04-26 11:34:00   Apr
10  188      2   2025/04/23  ...  2025/04/27 09:34 2025-04-27 09:34:00   Apr
11  127      3   2025/04/24  ...  2025/04/29 13:33 2025-04-29 13:33:00   Apr
12  179      2   2025/04/24  ...  2025/04/29 14:45 2025-04-29 14:45:00   Apr
13  160      1   2025/04/24  ...  2025/04/29 15:01 2025-04-29 15:01:00   Apr
14  117      2   2025/04/24  ...  2025/04/29 14:35 2025-04-29 14:35:00   Apr
15  130      2   2025/04/25  ...  2025/04/30 12:12 2025-04-30 12:12:00   Apr
16  173      3   2025/04/25  ...  2025/04/28 13:12 2025-04-28 13:12:00   Apr
17  190      1   2025/04/26  ...  2025/04/29 12:32 2025-04-29 12:32:00   Apr
18  141      2   2025/04/26  ...  2025/04/30 12:17 2025-04-30 12:17:00   Apr
19  101      1   2025/04/26  ...  2025/04/30 11:56 2025-04-30 11:56:00   Apr
20  102      3   2025/04/27  ...  2025/04/30 11:58 2025-04-30 11:58:00   Apr
21  112      2   2025/04/27  ...  2025/05/01 10:56 2025-05-01 10:56:00   May
22  157      1   2025/04/28  ...  2025/05/01 10:33 2025-05-01 10:33:00   May
23  196      1   2025/04/28  ...  2025/05/02 11:01 2025-05-02 11:01:00   May

[24 rows x 8 columns]

In [96]:
dt.datetime.dt.year  # The year

0     2025
1     2025
2     2025
3     2025
4     2025
5     2025
6     2025
7     2025
8     2025
9     2025
10    2025
11    2025
12    2025
13    2025
14    2025
15    2025
16    2025
17    2025
18    2025
19    2025
20    2025
21    2025
22    2025
23    2025
Name: datetime, dtype: int64

In [97]:
dt.datetime.dt.hour  # The hour

0     12
1     12
2     12
3     12
4     13
5     11
6     12
7     13
8     13
9     11
10     9
11    13
12    14
13    15
14    14
15    12
16    13
17    12
18    12
19    11
20    11
21    10
22    10
23    11
Name: datetime, dtype: int64